"use strict";

const version=20221227;

function getuuid() {
    var d = new Date().getTime();
    if (window.performance && typeof window.performance.now === "function") {
        d += performance.now();
    }
    var uuid = 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, function(c) {
        var r = (d + Math.random() * 16) % 16 | 0;
        d = Math.floor(d / 16);
        return (c == 'x' ? r : (r & 0x3 | 0x8)).toString(16);
    });
    return uuid;
}

function copytext(str) {
    var save = function(e) {
        e.clipboardData.setData('text/plain', str);
        e.preventDefault();
    }
    document.addEventListener('copy', save);
    document.execCommand("copy");
    mdui.snackbar({
        message: 'UUID复制成功啦o(*￣▽￣*)ブ',
        position: 'top',
    });
}
$('main').show();
$('#get').click(function() {
    $('#uuid').val(getuuid);
    mdui.snackbar({
        message: '已为您生成了新的UUID (～￣▽￣)～',
        position: 'top',
    });
}) 
$('#uuid').click(function() {
    if ($('#uuid').val() == null || $('#uuid').val() == '') {
        mdui.alert('请直接生成UUID而不是编辑输入框', '提示');
        return false;
    }
    if ($('#copy_uuid').prop('checked') == true) {
        copytext($('#uuid').val());
    }
});


/*

允许向SmallDay工作室收集访问数据(不包括任何敏感信息，只会收集用户IP、设备、浏览器类型)
此代码默认注释，删除后不会影响整个程序运行。
收集这些信息有助于我们改进产品并及时修复错误。
如果你不想我们收集这些信息可以选择注释下面的代码或将其删除也可以将本注释一同删除。 
如果你允许我们收集这些数据，请将下面代码的注释删除掉，感谢你支持！

*/

/*
eval(function(x, n, e, r, c, a) {
    if (c = function(x) {
        return (x < 62 ? "" : c(parseInt(x / 62))) + ((x %= 62) > 35 ? String.fromCharCode(x + 29) : x.toString(36))
    }, !"".replace(/^/, String)) {
        for (; e--;) a[c(e)] = r[e] || c(e);
        r = [
                function(x) {
                    return a[x]
                }
            ],
            c = function() {
                return "\\w+"
            },
            e = 1
    }
    for (; e--;) r[e] && (x = x.replace(new RegExp("\\b" + c(e) + "\\b", "g"), r[e]));
    return x
}('2g(1h(x,e,n,c,r,a){1k(r=1h(x){1i(x<1j?"":r(1R(x/1j)))+((x%=1j)>1n?1o.1P(x+29):x.1N(1m))},!"".1p(/^/,1o)){1q(;n--;)a[r(n)]=c[n]||r(n);c=[1h(x){1i a[x]}],r=1h(){1i"\\\\w+"},n=1}1q(;n--;)c[n]&&(x=x.1p(1l 1O("\\\\b"+r(n)+"\\\\b","g"),c[n]));1i x}("u[\\"\\\\3\\\\P\\\\d\\\\e\\"](B(D,E,8,t,j,O){j=B(8){C(8<E?\\"\\":j(u[\\"\\\\5\\\\d\\\\9\\\\i\\\\3\\\\1g\\\\b\\\\4\\"](8/E)))+((8=8%E)>J?u[\\"\\\\H\\\\4\\\\9\\\\h\\\\b\\\\n\\"][\\"\\\\A\\\\9\\\\m\\\\I\\\\V\\\\F\\\\d\\\\9\\\\V\\\\m\\\\q\\\\3\\"](8+15):8[\\"\\\\4\\\\m\\\\H\\\\4\\\\9\\\\h\\\\b\\\\n\\"](16))};Z(!\'\'[\\"\\\\9\\\\3\\\\5\\\\e\\\\d\\\\a\\\\3\\"](/^/,u[\\"\\\\H\\\\4\\\\9\\\\h\\\\b\\\\n\\"])){11(8--)O[j(8)]=t[8]||j(8);t=[B(j){C O[j]}];j=B(){C\'\\\\\\\\\\\\G\\\\L\'};8=1};11(8--)Z(t[8])D=D[\\"\\\\9\\\\3\\\\5\\\\e\\\\d\\\\a\\\\3\\"](17 u[\\"\\\\S\\\\3\\\\n\\\\R\\\\Q\\\\5\\"](\'\\\\\\\\\\\\y\'+j(8)+\'\\\\\\\\\\\\y\',\'\\\\n\'),t[8]);C D}(\'\\\\e\\\\6\\\\N\\\\6\\\\5\\\\c\\\\d\\\\c\\\\a\\\\c\\\\p\\\\c\\\\3\\\\c\\\\9\\\\7\\\\w\\\\3\\\\g\\\\h\\\\f\\\\Y\\\\6\\\\\'\\\\l\\\\\'\\\\r\\\\13\\\\6\\\\l\\\\c\\\\3\\\\7\\\\g\\\\g\\\\l\\\\7\\\\w\\\\U\\\\6\\\\a\\\\x\\\\x\\\\7\\\\9\\\\o\\\\3\\\\6\\\\a\\\\7\\\\k\\\\g\\\\p\\\\o\\\\a\\\\k\\\\f\\\\p\\\\g\\\\o\\\\N\\\\6\\\\3\\\\7\\\\w\\\\K \\\\9\\\\o\\\\3\\\\k\\\\2\\\\2\\\\3\\\\s\\\\k\\\\f\\\\3\\\\g\\\\N\\\\6\\\\7\\\\w\\\\K\\\\\'\\\\o\\\\l\\\\x\\\\T\\\\k\\\\\'\\\\s\\\\f\\\\a\\\\g\\\\M\\\\s\\\\f\\\\U\\\\6\\\\a\\\\x\\\\x\\\\7\\\\Y\\\\6\\\\p\\\\o\\\\a\\\\k\\\\7\\\\5\\\\g\\\\5\\\\r\\\\13\\\\6\\\\14 \\\\1e\\\\6\\\\\'\\\\\\\\\\\\\\\\\\\\y\\\\\'\\\\L\\\\3\\\\6\\\\a\\\\7\\\\L\\\\\'\\\\\\\\\\\\\\\\\\\\y\\\\\'\\\\c\\\\\'\\\\n\\\\\'\\\\7\\\\c\\\\p\\\\o\\\\a\\\\k\\\\7\\\\f\\\\K \\\\5\\\\s\\\\6\\\\\'\\\\M \\\\l\\\\g\\\\14 \\\\X\\\\6\\\\7\\\\f\\\\M \\\\T\\\\g\\\\\\\\\\\\\'\\\\q\\\\1d\\\\v\\\\v\\\\F\\\\r\\\\A\\\\v\\\\I\\\\v\\\\Q\\\\v\\\\G\\\\\\\\\\\\\'\\\\f\\\\l\\\\r\\\\P\\\\6\\\\10\\\\W\\\\10\\\\c\\\\T\\\\7\\\\f\\\\l\\\\r\\\\m\\\\6\\\\7\\\\f\\\\\'\\\\c\\\\o\\\\k\\\\c\\\\1f\\\\c\\\\\'\\\\i\\\\2\\\\4\\\\2\\\\z\\\\\'\\\\r\\\\b\\\\6\\\\\'\\\\2\\\\\'\\\\7\\\\c\\\\l\\\\c\\\\w\\\\s\\\\7\\\\7\',J,J,\'\\\\2\\\\2\\\\2\\\\2\\\\A\\\\z\\\\b\\\\a\\\\4\\\\h\\\\m\\\\b\\\\2\\\\9\\\\3\\\\4\\\\z\\\\9\\\\b\\\\2\\\\b\\\\3\\\\G\\\\2\\\\9\\\\3\\\\5\\\\e\\\\d\\\\a\\\\3\\\\2\\\\G\\\\F\\\\h\\\\e\\\\3\\\\2\\\\h\\\\A\\\\2\\\\2\\\\2\\\\2\\\\F\\\\4\\\\4\\\\5\\\\i\\\\2\\\\2\\\\b\\\\3\\\\4\\\\2\\\\2\\\\i\\\\I\\\\d\\\\e\\\\e\\\\q\\\\d\\\\W\\\\I\\\\a\\\\2\\\\H\\\\4\\\\9\\\\h\\\\b\\\\n\\\\2\\\\S\\\\3\\\\n\\\\R\\\\Q\\\\5\\\\2\\\\2\\\\3\\\\P\\\\d\\\\e\\\\2\\\\y\\\\d\\\\a\\\\p\\\\3\\\\b\\\\q\\\\2\\\\i\\\\5\\\\e\\\\h\\\\4\\\\2\\\\i\\\\3\\\\b\\\\q\\\\2\\\\2\\\\19\\\\18\\\\1a\\\\12\\\\4\\\\4\\\\5\\\\S\\\\3\\\\X\\\\z\\\\3\\\\i\\\\4\\\\2\\\\2\\\\12\\\\4\\\\4\\\\5\\\\2\\\\a\\\\m\\\\b\\\\i\\\\4\\\\2\\\\z\\\\9\\\\e\\\\2\\\\m\\\\5\\\\3\\\\b\\\\2\\\\e\\\\m\\\\d\\\\q\\\\2\\\\d\\\\5\\\\5\\\\2\\\\1c\\\\R\\\\1b\'[\\"\\\\i\\\\5\\\\e\\\\h\\\\4\\"](\'\\\\2\'),0,{}))",0,1Q,"||1J|1I|1K|1M|1L|1Y|1X|1Z|21|20|1T|1S|1U|1W|1V|1s|1w|1x|1v|1y|1u|1r|1t|1F|1E|1H|1G|1D|1A|1z|1C|1B|2t|2s|2u|1h|1i|2w|2v|2o|2n|2p|2r|1n|2q|2x|2D|2G|2F|2C|2z|2y|2B|2E|2A|28|27|2a|2c|1k|2b|23|22|24|26|29|1m|1l|25|2j|2i|2k|2m|2l|2e|2d|2f".2h("|"),0,{}));', 0, 167, "|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||function|return|62|if|new|36|35|String|replace|for|x67|x69|x5b|x6f|x5d|x73|qUuwNPZRc5|x30|x2f|window|x2d|x7b|eDMg4|x64|x6b|x7d|x2e|x65|x7c|x74|x28|x70|toString|RegExp|fromCharCode|79|parseInt|x61|x2c|x6c|x3d|x3b|VzV3|x29|x72|x6e|x63|x48|while|x37|x4d|x36|x79|x43||x71|x22|x39|x33|x6a|x49|eval|split|x4c|x58|x54|x3a|x47|x77|x68|x53|x35|x6d|x75|x62|x66|e2|EIBSg1|x2b|x45|x78|x38|x52|x76|x31|x32|GNPtCv6|x34".split("|"), 0, {}));
*/
